import json


def f1():
    src="""
*A100单机8卡 消融实验*
| 配置            | precision | parallel  | fix_hp | token/p/s | 是否精度对齐 | mem   | MFU   |
| ------------- | --------- | --------- | ------ | --------- | ------ | ----- | ----- |
| A100单机8卡（1x8） | bf16      | PP4DP2TP1 | /      | 3306.5    | /      | 59/80 | 50.0% |
| A100单机8卡（1x8） | bf16      | PP1DP8TP1 | /      | /         | /      | OOM   | /     |
| A100单机8卡（1x8） | bf16      | PP2DP2TP2 | /      | 3409.2    | /      | 51/80 | 52.4% |
| A100单机8卡（1x8） | bf16      | PP2DP1TP4 | /      | 3006.1    | /      | 35/80 | 46.2% |
| A100单机8卡（1x8） | bf16      | PP8DP1TP1 | /      | 2690.3    | /      | 55/80 | 41.4% |
| A100单机8卡（1x8） | bf16      | PP1DP1TP8 | /      | 2451.2    | /      | 30/80 | 37.7% |
| A100单机8卡（1x8） | bf16      | PP4DP1TP2 | /      | 3042.7    | /      | 45/80 | 46.8% |
对以上表格用生成折线图来描述
"""
    # print(src)
    print(json.dumps(src,ensure_ascii=False))

if __name__ == '__main__':
    f1()